# customer-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `failure`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-b202e078-ef75-4488-9fe8-741249feca61]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_api]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=h7ze4cak14]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer_api]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer_api-20230515112700886500000001]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/customer_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 1s [id=upstash-cluster-3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=006a4a5e5e5757b89cbcc0be5738c018bd854233]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_api"
        name       = "customer_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "8cea6828-27d1-45de-9ccb-b55a3ee6457e" -> "db66cb8c-20af-4918-9c8e-ea9ccfbe97c4"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default will be destroyed
  # (because upstash_kafka_credential.default is not in configuration)
  - resource "upstash_kafka_credential" "default" {
      - cluster_id      = (sensitive value) -> null
      - creation_time   = 1684150020 -> null
      - credential_id   = "b202e078-ef75-4488-9fe8-741249feca61" -> null
      - credential_name = "customer_api" -> null
      - id              = "upstash-kafka-credential-b202e078-ef75-4488-9fe8-741249feca61" -> null
      - password        = (sensitive value) -> null
      - permissions     = "PRODUCE" -> null
      - state           = "active" -> null
      - topic           = "customer.v1.event" -> null
      - username        = "ZmFzdC1hbnRlYXRlci02MDE2JHQdLlBfN37yrHICdiLy_-aZ7oa02qeOn9IWXOM" -> null
    }

Plan: 1 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*